obsidiansystems/freebsd-src/lib/libsys/pdfork.2
.\"
.\" Copyright (c) 2009-2010, 2012-2013 Robert N. M. Watson
.\" All rights reserved.
.\"
.\" This software was developed at the University of Cambridge Computer
.\" Laboratory with support from a grant from Google, Inc.
.\"
.\" This software was developed by SRI International and the University of
.\" Cambridge Computer Laboratory under DARPA/AFRL contract (FA8750-10-C-0237)
.\" ("CTSRD"), as part of the DARPA CRASH research programme.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd July 23, 2026
.Dt PDFORK 2
.Os
.Sh NAME
.Nm pdfork ,
.Nm pdrfork ,
.Nm pdopenpid ,
.Nm pdgetpid ,
.Nm pdkill ,
.Nm pdwait ,
.Nm pddupfd ,
.Nm pdexec ,
.Nm pdsetfd ,
.Nm pdsetfdrange ,
.Nm pdsetsigmask ,
.Nm pdsetsigign ,
.Nm pdchdir ,
.Nm pdsetpgid ,
.Nm pdsetschedparam ,
.Nm pdsetscheduler ,
.Nm pdresetids
.Nd System calls to manage process descriptors
.Sh LIBRARY
.Lb libc
.Sh SYNOPSIS
.In sys/procdesc.h
.In sched.h
.Ft pid_t
.Fn pdfork "int *fdp" "int pdflags"
.Ft pid_t
.Fn pdrfork "int *fdp" "int pdflags" "int rfflags"
.Ft int
.Fn pdopenpid "pid_t pid" "int pdflags"
.Ft int
.Fn pdgetpid "int fd" "pid_t *pidp"
.Ft int
.Fn pdkill "int fd" "int signum"
.Ft int
.Fo pdwait
.Fa "int fd"
.Fa "int *status"
.Fa "int options"
.Fa "struct __wrusage *wrusage"
.Fa "struct __siginfo *info"
.Fc
.Ft int
.Fn pddupfd "int fd" "int remotefd" "int flags"
.Ft int
.Fn pdexec "int fd" "int execfd" "char **argv" "char **envv" "int flags"
.Ft int
.Fn pdsetfd "int fd" "int remotefd" "int localfd"
.Ft int
.Fn pdsetfdrange "int fd" "u_int lowfd" "u_int highfd" "int flags"
.Ft int
.Fn pdsetsigmask "int fd" "const sigset_t *mask"
.Ft int
.Fn pdsetsigign "int fd" "const sigset_t *ign"
.Ft int
.Fn pdchdir "int fd" "int dirfd"
.Ft int
.Fn pdsetpgid "int fd" "pid_t pgid"
.Ft int
.Fn pdsetschedparam "int fd" "const struct sched_param *param"
.Ft int
.Fn pdsetscheduler "int fd" "int policy" "const struct sched_param *param"
.Ft int
.Fn pdresetids "int fd"
.Sh DESCRIPTION
Process descriptors are special file descriptors that represent processes,
and are created using
.Fn pdfork ,
a variant of
.Xr fork 2 ,
which, if successful, returns a process descriptor in the integer pointed to
by
.Fa fdp .
Processes created via
.Fn pdfork
will not cause
.Dv SIGCHLD
on termination.
.Fn pdfork
can accept the
.Fa pdflags:
.Bl -tag -width PD_CLOEXEC
.It Dv PD_DAEMON
Instead of the default terminate-on-close behaviour, allow the process to
live until it is explicitly killed with
.Xr kill 2 .
.Pp
This option is not permitted in
.Xr capsicum 4
capability mode (see
.Xr cap_enter 2 ) .
.Pp
Note: the option changes the behavior of
.Xr close 2
for the process descriptor returned by the operation.
If there is another process descriptor for the same process, created without
specifying the
.Dv PD_DAEMON
flag, closing that descriptor kills the process.
.It Dv PD_CLOEXEC
Set close-on-exec on process descriptor.
.It Dv PD_NOWAITPID
The parent cannot obtain the child's status with
.Xr waitpid 2 .
.El
.Pp
The
.Fn pdrfork
system call is a variant of
.Fn pdfork
that also takes the
.Fa rfflags
argument to control sharing of process resources between the caller
and the new process.
Like
.Fn pdfork ,
the function writes the process descriptor referencing the created
process into the location pointed to by the
.Fa fdp
argument.
See
.Xr rfork 2
for a description of the possible
.Fa rfflag
flags.
The
.Fn pdrfork
system call requires that both the
.Va RFPROC
and
.Va RFPROCDESC
flags, or
.Va RFSPAWN
flag are specified.
.Pp
The
.Fn pdopenpid
function opens the process descriptor for the process
specified by the argument
.Fa pid .
It takes the same flags in the
.Fa pdflags
argument as
.Fn pdfork .
The caller must have permission to debug the target process in order for
.Fn pdopenpid
to succeed.
Zombie processes cannot be opened.
.Pp
There might be more that one file descriptor referencing the process.
After the zombie is reaped, calls to
.Fn pdwait
specifying any file descriptors for the same process fail with the
.Er ESRCH
error.
.Pp
.Fn pdgetpid
queries the process ID (PID) in the process descriptor
.Fa fd .
.Pp
.Fn pdkill
is functionally identical to
.Xr kill 2 ,
except that it accepts a process descriptor,
.Fa fd ,
rather than a PID.
.Pp
The
.Fn pdwait
system call allows the calling thread to wait and retrieve
the status information on the process referenced by the
.Fa fd
process descriptor.
See the description of the
.Xr wait6 2
system call for the behavior specification.
.Pp
The
.Fn pddupfd
function allows the caller to duplicate a file descriptor
across the process boundaries.
The function returns the new file descriptor that points to the same file
as the file descriptor
.Fa remotefd
in the process specified by the
.Fa fd
process descriptor.
The returned file descriptor has the
.Va O_CLOEXEC
flag set.
The
.Fa flags
argument is reserved and must be zero.
Certain file descriptor types cannot be copied this way, namely
kqueues.
.Ss Creating a process without fork
The
.Fn pdrfork
function with an
.Fa rfflags
of
.Dv RFEMBRYO
creates an
.Em embryonic
process: one that exists but has never run.
It has no address space and no program, an empty file descriptor table
and default signal handling.
Because an embryo inherits nothing,
.Dv RFEMBRYO
describes the new process completely and may not be combined with the
other
.Xr rfork 2
flags, which say what is to be inherited.
On success, a process descriptor for it is stored in the integer pointed
to by
.Fa fdp ,
the pid of the new process is returned, and the
.Fa pdflags
argument takes the same flags as
.Fn pdfork .
.Pp
Unlike the traditional
.Fn fork Ns / Ns Fn execve
pattern, the new process is never a copy of the parent: its descriptors
are configured explicitly rather than inherited and then closed.
.Pp
The
.Fn pdexec
function gives the embryonic process a program and runs it.
The executable referenced by the file descriptor
.Fa execfd
is loaded (as with
.Xr fexecve 2 ) ,
and the
.Fa argv
and
.Fa envv
arguments specify the argument and environment vectors.
The
.Fa flags
argument is reserved and must be zero.
.Pp
Loading a program and running it is one operation, which is what
.Xr execve 2
does, aimed at another process rather than at the caller.
Leaving the process stopped with its program in place, so that it can be
configured further once the image is known, is future work.
.Pp
The exec is performed by the target process itself, on its own thread and
in its own address space, rather than by the caller.
The process therefore has no address space at all until
.Fn pdexec ,
and a failure to load the program is fatal to it: there is nothing for a
process that has never run to fall back to, so it is destroyed and its
creator learns of this through the process descriptor.
.Pp
.Fn pdexec
requires the
.Dv CAP_PDKILL
capability right on
.Fa fd
in addition to
.Dv CAP_PDSETFD ,
since starting a process is the same authority that killing one is
gated by.
.Pp
The
.Fn pdsetfd
function installs a file descriptor into the new process before it is
started, mirroring
.Fn pddupfd .
The descriptor
.Fa localfd
of the calling process is duplicated as descriptor
.Fa remotefd
in the process specified by the
.Fa fd
process descriptor.
It may be called multiple times to set up the new process's standard
I/O and any other descriptors it needs.
If
.Fa remotefd
is already set, it is replaced.
The retained capability rights of
.Fa localfd
are preserved on
.Fa remotefd .
.Fn pdsetfd
requires the
.Dv CAP_PDSETFD
capability right on
.Fa fd ;
see
.Sx SECURITY CONSIDERATIONS .
.Pp
When descriptor installation into the embryonic process is
.Em restricted
(see
.Sx SECURITY CONSIDERATIONS ) ,
.Fn pdsetfd
refuses, with
.Er EPERM ,
to install as
.Fa remotefd
0, 1 or 2 a descriptor whose backing may change out from under the
process after it starts, such as a
.Xr procfs 5
node.
These descriptors carry implicit significance as the standard input,
output and error streams, so the program may write to them without ever
naming them; the same protection is applied to a set-user-ID or
set-group-ID program's descriptors across
.Xr execve 2 .
Descriptors numbered 3 and above are not restricted.
(The first time it is scheduled, execution begins.)
After this call, the process descriptor behaves identically to one
created by
.Fn pdfork .
.Pp
An embryonic process inherits as little as possible from the process
that created it.
Where the traditional pattern begins with a copy of the parent and
undoes whatever is unwanted, this one begins with nothing and adds
whatever is wanted: inheritance is opt-in.
The file descriptor table is empty, all signals have their default
disposition and none are blocked, and no memory is shared.
What the new process does take from its creator is limited to the
properties it must have in order to exist at all: its credentials,
resource limits, process group, current working directory and root
directory, and scheduling parameters.
.Pp
A consequence worth noting is that state
.Xr execve 2
would have preserved is
.Em not
preserved here, because there is no prior program to preserve it from.
Signals set to
.Dv SIG_IGN
by the creator, for instance, are reset to their default disposition
rather than remaining ignored.
Callers emulating
.Xr fork 2 Ns / Ns Xr execve 2
semantics, such as an implementation of
.Xr posix_spawn 3 ,
must therefore establish such state explicitly.
.Ss Configuring an embryonic process
The following functions establish, on an embryonic process, the state that
.Xr fork 2 Ns / Ns Xr execve 2
would have conferred implicitly.
Each reimplements the inheriting that model would have done, so that a
caller such as
.Xr posix_spawn 3
can reproduce it without a child of its own.
All of them act on a process that has not started, require the
.Dv CAP_PDSETFD
capability right on
.Fa fd ,
and may be called in any order before
.Fn pdexec .
.Pp
The
.Fn pdsetfdrange
function is the bulk form of
.Fn pdsetfd :
it installs the caller's descriptors from
.Fa lowfd
through
.Fa highfd
into the new process at the same descriptor numbers.
Descriptors that are closed, or marked close-on-exec, are skipped, so
that what is copied is what would have survived an
.Xr execve 2 .
The
.Fa flags
argument is reserved and must be zero.
.Pp
The
.Fn pdsetsigmask
function sets the new process's signal mask to
.Fa mask ,
and
.Fn pdsetsigign
sets the signals in
.Fa ign
to be ignored.
An embryonic process blocks no signals and gives every signal its
default disposition, so a caller wanting the
.Xr execve 2
behaviour --- the mask preserved, and signals already ignored kept
ignored --- asks for it with these two calls.
.Dv SIGKILL
and
.Dv SIGSTOP
cannot be blocked or ignored and are silently skipped.
.Pp
The
.Fn pdchdir
function sets the new process's current working directory to the
directory named by the descriptor
.Fa dirfd ,
as
.Xr fchdir 2
would, using the caller's own lookup and permission check.
.Pp
The
.Fn pdsetpgid
function sets the new process's process group, as
.Xr setpgid 2 .
Unlike
.Xr setpgid 2
it does not refuse a process that has an image loaded, since an embryo
has not run that image and so has made no arrangements a caller could
disturb.
.Pp
The
.Fn pdsetschedparam
and
.Fn pdsetscheduler
functions set the scheduling parameters, and the scheduling policy and
parameters, of the new process, as
.Xr sched_setparam 2
and
.Xr sched_setscheduler 2 .
.Pp
The
.Fn pdresetids
function sets the new process's effective user and group ids to its real
ones, which is what
.Dv POSIX_SPAWN_RESETIDS
requests.
It must be done before
.Fn pdexec ,
so that the image's access check is made against the identity the process
will run as.
.Sh INTERACTION OF PROCESS DESCRIPTORS AND Xr WAITPID 2
.Pp
The
.Fn pdwait
system call may be called on a process descriptor
an unlimited number of times.
In particular, it does not reap the target process,
even if that process has exited.
Each time, it returns the same status.
.Bl -dash
.It
If the process was forked with
.Fn pdfork ,
and the
.Dv PD_NOWAITPID
flag was specified, then the process is automatically reaped after the
last process descriptor referencing that process is closed.
No
.Xr waitpid 2
call
.Pq or a call from the same family of the wait functions which operate on PIDs
are needed to reap the zombie process.
.It
If the process was created by
.Fn pdfork ,
and the
.Dv PD_NOWAITPID
flag was not specified, then after exiting,
the process will not be reaped until the parent or reaper has called
.Xr waitpid 2
and all process descriptors referencing the process are closed.
.It
If the process was created by the
.Xr fork 2
system call
.Pq which does not allocate a process descriptor for the child ,
and later the process was opened by
.Fn pdopenpid ,
then a
.Xr waitpid 2
call from the parent is needed to reap the exited child.
.El
.Pp
In any case, the PID of the process is not reused until its zombie
is reaped, and all its process descriptors are closed.
.Pp
A debugger attached by
.Xr ptrace 2
can execute the
.Fn waitpid
calls against the alive target regardless of the way
the target process was forked.
.Sh INTERACTION OF PROCESS DESCRIPTORS WITH OTHER SYSTEM CALLS
.Pp
The following system calls also have effects specific to process descriptors:
.Pp
.Xr fstat 2
queries status of a process descriptor; currently only the
.Fa st_mode ,
.Fa st_birthtime ,
.Fa st_atime ,
.Fa st_ctime
and
.Fa st_mtime
fields are defined.
If the owner read, write, and execute bits are set then the
process represented by the process descriptor is still alive.
.Pp
.Xr poll 2
and
.Xr select 2
allow waiting for process state transitions; currently only
.Dv POLLHUP
is defined, and will be raised when the process dies.
Process state transitions can also be monitored using
.Xr kqueue 2
filter
.Dv EVFILT_PROCDESC ;
currently only
.Dv NOTE_EXIT
is implemented.
.Pp
.Xr close 2
will close the process descriptor unless
.Dv PD_DAEMON
is set; if the process is still alive and this is
the last reference to the process descriptor, the process will be terminated
with the signal
.Dv SIGKILL .
The PID of the referenced process is not reused until the process
descriptor is closed,
whether or not the zombie process is reaped by
.Fn pdwait ,
.Xr wait6 ,
or similar system calls.
.Sh RETURN VALUES
.Fn pdfork
and
.Fn pdrfork
return a PID, 0 or -1, as
.Xr fork 2
does.
.Pp
.Fn pdopenpid ,
.Fn pdgetpid ,
.Fn pdkill ,
.Fn pdwait ,
.Fn pddupfd ,
.Fn pdrfork ,
.Fn pdsetfd ,
.Fn pdsetfdrange ,
.Fn pdsetsigmask ,
.Fn pdsetsigign ,
.Fn pdchdir ,
.Fn pdsetpgid ,
.Fn pdsetschedparam ,
.Fn pdsetscheduler ,
and
.Fn pdresetids
return 0 on success and -1 on failure.
.Sh ERRORS
These functions may return the same error numbers as their PID-based equivalents
(e.g.
.Fn pdfork
may return the same error numbers as
.Xr fork 2 ) ,
with the following additions:
.Bl -tag -width Er
.It Bq Er EFAULT
The copyout of the resulting file descriptor value to the memory pointed
to by
.Fa fdp
failed.
.Pp
Note that the child process was already created when this condition
is detected,
and the child continues execution, same as the parent.
If this error must be handled, it is advisable to memoize the
.Fn getpid
result before the call to
.Fn pdfork
or
.Fn pdrfork ,
and compare it to the value returned by
.Fn getpid
after, to see if code is executing in parent or child.
.It Bq Er EINVAL
The signal number given to
.Fn pdkill
is invalid.
.It Bq Er ENOTCAPABLE
The process descriptor being operated on has insufficient rights (e.g.
.Dv CAP_PDKILL
for
.Fn pdkill ) .
.It Bq Er EINVAL
The
.Fn pdwait
function is called with reserved bits set in
.Fa options .
.El
.Pp
The
.Fn pdopenpid
might return the same errors as
.Xr open 2 ,
related to the file descriptor allocation problems, as well as the
following specific errors:
.Bl -tag -width Er
.It Bq Er EINVAL
The
.Fa flags
argument has reserved bits set.
.It Bq Er ECAPMODE
.Fn pdopenpid
is called by the process in capability mode.
.It Bq Er EBUSY
The process specified by the
.Fa pid
argument already terminated.
.It Bq Er ESRCH
The process specified by the
.Fa pid
argument does not exist, or the caller does not have enough privileges
to open the process.
.It Bq Er EMFILE
The calling process already reached its limit for open file descriptors.
.Pp
Current implementation installs the opened process descriptor into the
calling process's file descriptors table.
If the descriptor cannot be installed, the process descriptor is closed,
which executes all actions performed by
.Xr close 2
on it.
.El
.Pp
The
.Fn pddupfd
returns the following errors:
.Bl -tag -width Er
.It Bq Er EINVAL
The
.Fa flags
argument is not zero.
.It Bq Er EINVAL
The file descriptor
.Fa fd
is not a process file descriptor.
.It Bq Er ESRCH
The process specified by the file descriptor
.Fa fd
exited.
.It Bq Er EBADF
The file descriptor
.Fa remotefd
is not a valid file descriptor in the specified process.
.It Bq Er ENOENT
The specified process does not have a file descriptor table.
.It Bq Er EOPNOTSUPP
.Fa remotefd
refers to a file that cannot be duplicated across a process boundary,
such as a kqueue.
.El
.Pp
The
.Fn pdrfork
.Pp
The
.Fn pdsetfd
function may fail with:
.Bl -tag -width Er
.It Bq Er EBADF
.Fa fd
or
.Fa localfd
is not a valid file descriptor.
.It Bq Er EINVAL
.Fa fd
is not a process file descriptor.
.It Bq Er EINVAL
The process specified by the
.Fa fd
process descriptor has already been started.
.It Bq Er EPERM
Descriptor installation into the embryonic process is
.Em restricted
(see
.Sx SECURITY CONSIDERATIONS ) ,
.Fa remotefd
is 0, 1 or 2, and
.Fa localfd
references a file whose backing may change after execution begins.
.El
.Sh SECURITY CONSIDERATIONS
Like most types of file descriptors, process descriptors may be passed
to another process.
A process created with
.Fn pdrfork
runs with the credentials of the process that called
.Fn pdrfork ,
.Em not
the credentials of whichever process eventually starts it.
Therefore, handing off a process descriptor to an embryonic process
should be considered to have security risks similar to marking a binary
set-user-ID \(em in both cases a possibly less-privileged process has
the ability to initialize a more-privileged process with resources,
which can lead to
.Em confused deputy
privilege escalations if the executable in question was not specifically
designed with this use case in mind.
.Pp
This situation motivates the notion of a
.Em restricted
embryonic process.
Descriptor installation with
.Fn pdsetfd
is restricted when either of the following holds:
.Bl -bullet
.It
The embryonic process is executing a set-user-ID or set-group-ID
program.
.It
The calling process runs as a different user or group than the
embryonic process, and the embryonic process will not run in capability
mode (see
.Xr capsicum 4 ) .
.El
.Pp
Two aspects of this condition warrant explanation:
.Bl -bullet
.It
The set-user-ID and set-group-ID condition is largely redundant: it adds
coverage only when the embryonic process's set IDs coincide with the
calling process's, or when the embryonic process is in capability mode
(where the second condition does not apply).
It could be argued that no restriction is warranted in those cases, but
out of an abundance of caution, and out of respect for the intent of the
set-user-ID and set-group-ID bits, the restriction is applied anyway.
.It
Capability mode is excluded from the second condition because a
sandboxed embryonic process's ambient credentials are not meant to
matter: all authority should stem from the open file descriptors alone.
.El
.Pp
For a restricted process,
.Fn pdsetfd
declines to install a descriptor referring to a file deemed unsafe as
descriptor 0, 1 or 2, protecting those descriptor numbers from certain
confused-deputy problems.
(The
.Sx DESCRIPTION
describes which files are deemed unsafe.)
However, this still leaves higher-numbered descriptors unprotected, and
low-numbered ones still only semi-protected, as confused-deputy
problems involving a
.Dq safe
descriptor at 0, 1 or 2 are still possible.
.Pp
To mitigate these remaining issues,
the operations on an unstarted process are gated by separate capability
rights so that authority can be delegated at a fine granularity:
.Fn pdsetfd
requires
.Dv CAP_PDSETFD ,
while
.Xr pdkill 2
merely requires
.Dv CAP_PDKILL .
If the
.Fn pdrfork
caller uses
.Xr cap_rights_limit 2
to delegate a descriptor that permits starting or killing the process
without permitting its descriptor table to be reconfigured, then the
security concern is mitigated.
.Sh SEE ALSO
.Xr close 2 ,
.Xr fork 2 ,
.Xr fstat 2 ,
.Xr kill 2 ,
.Xr kqueue 2 ,
.Xr poll 2 ,
.Xr wait4 2 ,
.Xr capsicum 4 ,
.Xr procdesc 4
.Sh HISTORY
The
.Fn pdfork ,
.Fn pdgetpid ,
and
.Fn pdkill
system calls first appeared in
.Fx 9.0 .
The
.Fn pdrfork
and
.Fn pdwait
system calls first appeared in
.Fx 15.1 .
The
.Fn pdopenpid
and
.Fn pddupfd
system calls first appeared in
.Fx 16.0 .
The
.Fn pdrfork
and
.Fn pdsetfd
system calls first appeared in
.Fx 16.0 .
.Pp
Support for process descriptors mode was developed as part of the
.Tn TrustedBSD
Project.
.Sh AUTHORS
.An -nosplit
These functions and the capability facility were created by
.An Robert N. M. Watson Aq Mt rwatson@FreeBSD.org
and
.An Jonathan Anderson Aq Mt jonathan@FreeBSD.org
at the University of Cambridge Computer Laboratory with support from a grant
from Google, Inc.
The
.Fn pdrfork
and
.Fn pdwait
functions were developed by
.An Konstantin Belousov Aq Mt kib@FreeBSD.org
with input from
.An Alan Somers Aq Mt asomers@FreeBSD.org .
The
.Fn pdopenpid
and
.Fn pddupfd
functions were developed by
.An Konstantin Belousov Aq Mt kib@FreeBSD.org .
The
.Fn pdrfork
and
.Fn pdsetfd
functions were developed by
.An John Ericson Aq Mt subscribe@johnericson.me .
